# Taps
tap 'nicoverbruggen/homebrew-cask' # PHPMon
tap 'shivammathur/php'
tap 'shivammathur/extensions'

# Configuration
cask_args appdir: "~/Applications", require_sha: true

# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'httpie'
brew 'pkg-config'
brew 'stow'
brew 'neofetch'
brew 'neovim'
brew 'zoxide'

# Development
brew 'shivammathur/php/php@8.1'
brew 'shivammathur/php/php@8.2'
brew 'shivammathur/php/php@8.3'
brew 'shivammathur/php/php@8.4'
brew 'composer'
brew 'mariadb'
brew 'nginx'
brew 'yarn'
brew 'nvm'
brew 'mailhog'
brew 'make'
brew 'python@3.9'
brew 'tmux'
brew 'redis'

# Apps
cask 'obsidian'
cask 'sublime-text'
cask 'raycast'
cask 'docker'
cask 'keepassxc'
cask 'rectangle'
cask 'tableplus'
cask 'termius'
cask 'bartender'
cask 'ticktick'
cask 'the-unarchiver'
cask 'nicoverbruggen/homebrew-cask/phpmon'