# Binaries
brew 'bash' # Latest Bash version
brew 'bat' # "cat" on steroids
brew 'coreutils' # Those that come with macOS are outdated
brew 'git'
brew 'httpie'
brew 'pkg-config'
brew 'stow'
brew 'bitwarden-cli'

# Development
brew 'php'
brew 'php@8.1'
brew 'composer'
brew 'mariadb'
brew 'nginx'
brew 'yarn'
brew 'nvm'

# Apps
cask 'sublime-text'
cask 'raycast'

# Mac App Store
mas 'The Unarchiver', id: 425424353
